base-devel
git
github-cli
curl
chezmoi
age
networkmanager
pipewire
wireplumber
pavucontrol
niri
greetd
keyd
foot
fcitx5
fcitx5-rime
fcitx5-gtk
fcitx5-qt
fcitx5-chinese-addons
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-gnome
xwayland-satellite
qt5ct
qt6ct
papirus-icon-theme
inter-font
ttf-fira-code
ttf-nerd-fonts-symbols-mono
noto-fonts-cjk
ttf-sarasa-gothic
noto-fonts-emoji
neovim
ripgrep
fd
fzf
fish
zoxide
starship
jq
bat
btop
eza
git-delta
lazygit
rustup
go
python
unzip
zip
man-db
man-pages
